Tekla.Structures.Catalogs.RebarItem.ExtraPointShortening
Gets or sets the extra point shortening.

Tekla.Structures.Catalogs.RebarItem.CurveTolerance
Gets or sets the curve tolerance.

Tekla.Structures.Catalogs.RebarItem.MaxRadiusRequiringBending
Gets or sets the max radius requiring bending.

Tekla.Structures.Catalogs.RebarItem.FromStruct(Tekla.Structures.Catalogs.RebarItem)
Assigns the properties of the specified rebar item to this one.
rebarItem: The rebar item.